"use strict";

//пример 1
let a = 1, b = 1, c, d;
c = ++a;
alert(c); // ответ: 2
//префиксное инкрементирование - сначала производится изменение а потом возврат значения

//пример 2
d = b++;
alert(d); //ответ: 1
//постфиксное инкрементирование - сначала производится возврат значения а затем изменение

//пример 3
c = 2 + ++a;
alert(c); //ответ: 5
//в примере 1 переменной а было увеличено значение на 1, после чего в текущем примере использовалось префиксное инкрементирование и прибавлено 2

//пример 4
d = 2 + b++;
alert(d); //ответ: 4
//в примере 2 переменной а было увеличено значение на 1, после чего в текущем примере использовалось постфиксное инкрементирование и прибавлено 2
alert(a); //3
//в примерах 1 и 3 изменено значение
alert(b); //3
//в примерах 2 и 4 изменено значение